cases/subsonic/Zhang/We500/b_6Dinj/setup/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288;

boundaryField
{
    gasInlet
    {
        type            fixedValue;
        value           uniform 288;
    }

    outletRight
    {
        type            inletOutlet;
        inletValue      uniform 288;
        value           uniform 288;
    }

    outletTop
    {
        type            inletOutlet;
        inletValue      uniform 288;
        value           uniform 288;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    filmTopWall
    {
        type            zeroGradient;
    }

    stepWall
    {
        type            zeroGradient;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
